### [ 데이터 필터링 ]
- 원하는 데이터를 추출하기 위해서 사용하는 방법
- 원하는 데이터 걸러내겠다는 의미
- 다양한 조건 검사 진행 => 비교 검사 : 같다 ==, 같지 않다 !=, 크다 >, 크거나 같다 >=, 작다 <, 작거나 같다 <=

(1) 모듈 로딩 <hr>

In [60]:
import pandas as pd
import numpy as np

(2) 데이터 준비 <hr>

In [61]:
file='../DATA/employees.csv'

(3) 데이터 저장 <hr>

In [62]:
empDF=pd.read_csv(file)

(4) 데이터 확인 <hr>

In [63]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.1+ KB

(5) 데이터 필터링

In [64]:
'Happy' == 'Happy', 'Happy' == 'happy'

(True, False)

- [문제] 데이터에서 이름이 Maria인 데이터만 추출

In [65]:
print(empDF.columns, empDF.index, sep='\n\n')

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

RangeIndex(start=0, stop=1001, step=1)

- bool값으로 구성된 데이터 ==> 불린인덱싱(Boolean Indexing)

In [66]:
empDF['First Name'] == 'Maria'

0       False
1       False
2        True
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: First Name, Length: 1001, dtype: bool

In [67]:
mariaMask = (empDF['First Name'] == 'Maria')

print(type(mariaMask), mariaMask.sum(), sep=' ')

<class 'pandas.core.series.Series'> 6

In [68]:
empDF[mariaMask]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [69]:
empDF[empDF['First Name'] == 'Maria']

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
198      Maria  Female   12/27/90   36067.0   True       Product
815      Maria     NaN    1/18/86  106562.0  False            HR
844      Maria     NaN    6/19/85  148857.0  False         Legal
936      Maria  Female    3/14/03   96250.0  False  Business Dev
984      Maria  Female   10/15/11   43455.0  False   Engineering

In [70]:
empDF

     First Name  Gender Start Date    Salary   Mgmt          Team
0       Douglas    Male     8/6/93       NaN   True     Marketing
1        Thomas    Male    3/31/96   61933.0   True           NaN
2         Maria  Female        NaN  130590.0  False       Finance
3         Jerry     NaN     3/4/05  138705.0   True       Finance
4         Larry    Male    1/24/98  101004.0   True            IT
...         ...     ...        ...       ...    ...           ...
996     Phillip    Male    1/31/84   42392.0  False       Finance
997     Russell    Male    5/20/13   96914.0  False       Product
998       Larry    Male    4/20/13   60500.0  False  Business Dev
999      Albert    Male    5/15/12  129949.0   True         Sales
1000        NaN     NaN        NaN       NaN    NaN           NaN

[1001 rows x 6 columns]

- [문제] employees 데이터에서 이름이 연봉이 50000이상인 데이터 추출

In [71]:
empDF['Salary'] >= 50000

0       False
1        True
2        True
3        True
4        True
        ...
996     False
997      True
998      True
999      True
1000    False
Name: Salary, Length: 1001, dtype: bool

In [72]:
empDF[empDF['Salary'] >= 140000]

    First Name  Gender Start Date    Salary   Mgmt          Team
36      Rachel  Female    2/16/09  142032.0  False  Business Dev
44     Cynthia  Female   11/16/88  145146.0   True       Product
83       Shawn    Male    9/23/05  148115.0   True       Finance
87       Annie  Female    1/30/93  144887.0   True         Sales
96     Cynthia  Female    3/21/94  142321.0  False       Finance
..         ...     ...        ...       ...    ...           ...
948     Ashley  Female    3/31/06  142410.0   True   Engineering
951        NaN  Female    9/14/10  143638.0    NaN           NaN
979     Ernest    Male    7/20/13  142935.0   True       Product
981      James    Male    1/15/93  148985.0  False         Legal
983       John    Male   12/23/82  146907.0  False   Engineering

[80 rows x 6 columns]

- [문제] employees 데이터에서 성별이 남자이며 연봉이 100000이상인 데이터 조회출

In [73]:
(empDF['Gender']=='Male').head()

0     True
1     True
2    False
3    False
4     True
Name: Gender, dtype: bool

In [74]:
(empDF['Salary']>=100000).head()

0    False
1    False
2     True
3     True
4     True
Name: Salary, dtype: bool

- 여러 개의 조건이 모두 True 여야만 하는 조건 =>> AND 조건
    * 문법 : 조건1 & 조건2 & 조건3 & .... & 조건N
    * 연산자 : & 엠퍼센트
    * 결과 : True/False

In [75]:
mask = ( (empDF['Gender']=='Male') & (empDF['Salary']>=148000) )
type(mask), mask.sum()

(pandas.core.series.Series, 5)

In [76]:
empDF[mask]

    First Name Gender Start Date    Salary   Mgmt     Team
83       Shawn   Male    9/23/05  148115.0   True  Finance
318        Roy   Male     8/6/06  148225.0  False  Finance
800   Clarence   Male     8/5/89  148941.0  False  Product
850    Charles   Male     9/3/97  148291.0  False      NaN
981      James   Male    1/15/93  148985.0  False    Legal

- 여러 개의 조건 중 1개 이상이 True면 True가 되는 조건 =>> OR 조건
    * 문법 : 조건1 | 조건2 | 조건3 | .... | 조건N
    * 연산자 : | 파이프 ==> 키보드 Enter키 위에 있음
    * 결과 : True/False

- [문제] employees 데이터에서 입사일이 1993년 1월 1일 이전 이거나 또는 팀이 없는 사람 데이터 조회

In [77]:
empDF['Start Date'] < "1/1/93"

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Start Date, Length: 1001, dtype: bool

In [78]:
empDF['Mgmt'] == False

0       False
1       False
2        True
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Name: Mgmt, Length: 1001, dtype: bool

In [79]:
(empDF['Start Date'] < "1/1/93") | (empDF['Mgmt'] == False)

0       False
1       False
2        True
3       False
4       False
        ...
996      True
997      True
998      True
999     False
1000    False
Length: 1001, dtype: bool

In [80]:
empDF[(empDF['Start Date'] < "1/1/93") | (empDF['Mgmt'] == False)]

    First Name  Gender Start Date    Salary   Mgmt          Team
2        Maria  Female        NaN  130590.0  False       Finance
5       Dennis    Male    4/18/87  115163.0  False         Legal
13        Gary    Male    1/27/08  109831.0  False         Sales
15     Lillian  Female     6/5/16   59414.0  False       Product
16      Jeremy    Male    9/21/10   90370.0  False            HR
..         ...     ...        ...       ...    ...           ...
989     Justin     NaN    2/10/91   38344.0  False         Legal
995      Henry     NaN   11/23/14  132483.0  False  Distribution
996    Phillip    Male    1/31/84   42392.0  False       Finance
997    Russell    Male    5/20/13   96914.0  False       Product
998      Larry    Male    4/20/13   60500.0  False  Business Dev

[466 rows x 6 columns]

In [81]:
empDF['Start Date'] = pd.to_datetime(empDF['Start Date'], format='%m/%d/%y')

In [82]:
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    datetime64[ns]
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: datetime64[ns](1), float64(1), object(4)
memory usage: 47.1+ KB

In [83]:
(empDF['Team'] == 'Sales') | (empDF['Team'] == 'Legal') | (empDF['Team'] == 'Marketing')

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

In [84]:
empDF['Team'].isin(['Sales', 'Legal', 'Marketing'])

0        True
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999      True
1000    False
Name: Team, Length: 1001, dtype: bool

- 구간 지정 검사 불린 메서드 => DF.between(low, high)

In [85]:
(empDF['Salary']>=80000) & (empDF['Salary']<90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [86]:
empDF['Salary'].between(80000, 90000)

0       False
1       False
2       False
3       False
4       False
        ...
996     False
997     False
998     False
999     False
1000    False
Name: Salary, Length: 1001, dtype: bool

In [90]:
empDF['First Name'].str.upper(), empDF['First Name'].str.lower()

(0       DOUGLAS
 1        THOMAS
 2         MARIA
 3         JERRY
 4         LARRY
          ...
 996     PHILLIP
 997     RUSSELL
 998       LARRY
 999      ALBERT
 1000        NaN
 Name: First Name, Length: 1001, dtype: object,
 0       douglas
 1        thomas
 2         maria
 3         jerry
 4         larry
          ...
 996     phillip
 997     russell
 998       larry
 999      albert
 1000        NaN
 Name: First Name, Length: 1001, dtype: object)